# ThermalExpansionCoefficient Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ThermalExpansionCoefficient Property
SpecTypeId Class See Also
---
Thermal Expansion Coefficient, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ThermalExpansionCoefficient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalExpansionCoefficient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalExpansionCoefficient {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace